#+STARTUP: showall
#+STARTUP: logdone
#+STARTUP: lognotedone
#+STARTUP: hidestars
#+FILETAGS: 1B
#+SELECT_TAGS: JA
#+BIBLIOGRAPHY: ~/org/Bibliography/Literatur authoryear-ibid
#+TODO: TODO(t) STARTED(s!) WAITING(w@/!) APPT(a) PROJ(p) NOTIZ(n) BESPROCHEN(b) DELEGATED(g@/!) | DONE(d!) ZKTO(z) CANCELED(c@)
#+SETUPFILE: ~/org/latex_setup.org
#+TITLE: 1B
#+AUTHOR: Matthias Fuchs
#+EMAIL: matthiasfuchs01@gmail.com 

* Mitarbeit

* Verhalten

* Heftführung
 
* 4B [KV Manuela Singer]
:PROPERTIES:
:CUSTOM_ID: Klasse4B
:END:

#+Name: 2021-students
| First     | Last     | Email                                    | Name               | Notes |
|-----------+----------+------------------------------------------+--------------------+-------|
| Firstname | Lastname | [[mailto:Firstname.Lastname@golling.schule]] | [[contact:FirstnameLastname][Firstname Lastname]] |     1 |
| Peter     | Maier    | [[mailto:Peter.Maier@golling.schule]]        | [[contact:PeterMaier][Peter Maier]]        |     1 |
| Maria     | Fuchs    | [[mailto:Maria.Fuchs@golling.schule]]        | [[contact:MariaFuchs][Maria Fuchs]]        |     1 |
| Hans      | Huber    | [[mailto:Hans.Huber@golling.schule]]         | [[contact:HansHuber][Hans Huber]]         |     1 |
#+TBLFM: $3='(concat "[[mailto:"$1"."$2"@golling.schule]]")
#+TBLFM: $4='(concat "[[contact:" $1 $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(2021-22-Mitarbeit,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
print('*** My lecture 2021')
for student in table:
    first = student[0]
    last = student[1]
    email = first + '.' + last + '@golling.schule'
    print('**** ' + first + ' ' + last + ' ' * 40 + ':' + first + last + ':')
    print(':PROPERTIES:')
    print(':TYPE: person')
    print(':TITLE:')
    print(':EMAIL: ' + email)
    print(':URL:')
    print(':MOBILE: +43/')
    print(':HOMEPHONE:')
    print(':WORKPHONE:')
    print(':PHONE:')
    print(':COMPANY:')
    print(':STREET:')
    print(':POSTALCODE:')
    print(':CITY:')
    print(':COUNTRY: Österreich')
    print(':BORN:')
    print(':ITOLDTHEM_EMAIL: matthias.fuchs@golling.schule')
    print(':ITOLDTHEM_ADDRESS:')
    print(':ITOLDTHEM_PHONE:')
    print(':ADDRESS_CHANGE_METHOD:')
    print(':END:\n')
#+END_SRC



Whenever there is some grading going on, I create lists for the class such as:

#+Name: 2021-22-Mitarbeit
| Name               | Notes | [[id:01_SW01][SW01]] | [[id:01_SW02][SW02]] | [[id:01_SW03][SW03]] | [[id:01_SW04][SW04]] | [[id:01_SW05][SW05]] | [[id:01_SW06][SW06]] | [[id:01_SW07][SW07]] | [[id:01_SW08][SW08]] | [[id:01_SW09][SW09]] | [[id:01_SW10][SW10]] | [[id:01_SW11][SW11]] | [[id:01_SW12][SW12]] | [[id:01_SW13][SW13]] | [[id:01_SW14][SW14]] | [[id:01_SW15][SW15]] | [[id:01_SW16][SW16]] | [[id:01_SW17][SW17]] | [[id:01_SW18][SW18]] | [[id:01_SW19][SW19]] | [[id:01_SW20][SW20]] | [[id:01_SW21][SW21]] | [[id:01_SW22][SW22]] |
|--------------------+-------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------|
| [[contact:FirstnameLastname][Firstname Lastname]] |     1 |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |
| [[contact:PeterMaier][Peter Maier]]        |     1 |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |
| [[contact:MariaFuchs][Maria Fuchs]]        |     1 |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |
| [[contact:HansHuber][Hans Huber]]         |     1 |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |      |
#+TBLFM: $2=vmean($INVALID..$>)
#+TBLFM: $1='(identity remote(2021-students,@@#$4))



